In [1]:
from math import sqrt
from scipy import stats

import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data
import statistics
import acquire

# In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
df = sns.load_dataset('iris')

In [3]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [4]:
df.shape

(150, 5)

In [5]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [7]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## I dont know if scaling this data would help.  Im too new at this moment to know for sure

# Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [8]:
df_excel = pd.read_csv("mytable_customer.csv")

In [9]:
df_excel_sample = df_excel[0:100]

In [10]:
df_excel_sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             100 non-null    object
 1   gender                  100 non-null    object
 2   is_senior_citizen       100 non-null    int64
 3   partner                 100 non-null    object
 4   dependents              100 non-null    object
 5   partner_dependents      100 non-null    int64
 6   phone_service           100 non-null    int64
 7   internet_service        100 non-null    int64
 8   contract_type           100 non-null    int64
 9   payment_type            100 non-null    object
 10  monthly_charges         100 non-null    float64
 11  total_charges           100 non-null    object
 12  churn                   100 non-null    object
 13  tenure                  100 non-null    float64
 14  avg charges             100 non-null    object
 15  Check                   100 non-null    object
 16  Start Date              100 non-null    int64
 17  is_female               100 non-null    bool
 18  has_churned             100 non-null    bool
 19  has_phone               100 non-null    bool
 20  has_internet            100 non-null    bool
 21  has_phone_and_internet  100 non-null    bool
 22  Contract Type           100 non-null    object
 23  Phone Service           100 non-null    object
 24  Internet Service        100 non-null    object
dtypes: bool(5), float64(2), int64(6), object(12)
memory usage: 16.2+ KB

In [11]:
df_excel.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [12]:
df_excel.select_dtypes(include=['object']).columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'total_charges', 'churn', 'avg charges', 'Check', 'Contract Type',
       'Phone Service', 'Internet Service'],
      dtype='object')

In [13]:
int_columns = df_excel.select_dtypes(include=['int64']).columns

In [14]:
float_columns = df_excel.select_dtypes(include=['float64']).columns

In [15]:
colmns = []

In [16]:
for number in int_columns:
    print(f"Column: {number} Min: {df_excel[number].min()} Max: {df_excel[number].max()}")

Column: is_senior_citizen Min: 0 Max: 1
Column: partner_dependents Min: 0 Max: 3
Column: phone_service Min: 0 Max: 2
Column: internet_service Min: 0 Max: 2
Column: contract_type Min: 0 Max: 2
Column: Start Date Min: 20150112 Max: 20210812

In [17]:
for number in float_columns:
    print(f"Column: {number} Min: {df_excel[number].min()} Max: {df_excel[number].max()}")

Column: monthly_charges Min: 18.25 Max: 118.75
Column: tenure Min: 0.0 Max: 79.34

# Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [18]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1cxVHKG3lH31PLFLxLqaP1AH5OTkYIwCALHfgAUFje1M/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [19]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [20]:
df_google.shape

(891, 12)

In [21]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [24]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [25]:
df_google.nunique() < 8

PassengerId    False
Survived        True
Pclass          True
Name           False
Sex             True
Age            False
SibSp           True
Parch           True
Ticket         False
Fare           False
Cabin          False
Embarked        True
dtype: bool

In [26]:
df_google.nunique()[df_google.nunique() < 8]

Survived    2
Pclass      3
Sex         2
SibSp       7
Parch       7
Embarked    3
dtype: int64

In [27]:
categorical = df_google.nunique()[df_google.nunique() < 8].index

In [28]:
categorical

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked'], dtype='object')

In [29]:
for cat in categorical:
    print(f'{cat}: {df_google[cat].value_counts().index}' )

Survived: Int64Index([0, 1], dtype='int64')
Pclass: Int64Index([3, 1, 2], dtype='int64')
Sex: Index(['male', 'female'], dtype='object')
SibSp: Int64Index([0, 1, 2, 4, 3, 8, 5], dtype='int64')
Parch: Int64Index([0, 1, 2, 3, 5, 4, 6], dtype='int64')
Embarked: Index(['S', 'C', 'Q'], dtype='object')

Use the function defined in acquire.py to load the iris data.

Drop the species_id and measurement_id columns.

Rename the species_name column to just species.

Create dummy variables of the species name.

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [30]:
clear

In [39]:
df = acquire.get_iris_data()

In [40]:
df.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

In [41]:
df = df.drop(columns = ['species_id'])

In [42]:
df.head(3)

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2

In [45]:
df = df.rename(columns={"species_name": "species"})

In [46]:
df.head(3)

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2

In [47]:
df_dummy = pd.get_dummies(df['species'], drop_first=True)

In [48]:
df_dummy.head(3)

   versicolor  virginica
0           0          0
1           0          0
2           0          0

In [49]:
df= pd.concat([df, df_dummy], axis = 1)

In [50]:
df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [51]:
def prep_iris():
    df = acquire.get_iris_data()
    df = df.drop(columns = ['species_id'])
    df = df.rename(columns={"species_name": "species"})
    df_dummy = pd.get_dummies(df['species'], drop_first=True)
    df= pd.concat([df, df_dummy], axis = 1)
    return df